window.COURSE_DATA = {
  "updatedFromWorkbook": "2026-07-24T13:26:21",
  "student": "Σέργιος",
  "examCourses": [
    {
      "Μαθήματα": "Διαφορικός ΙΙ",
      "Περίοδος": "Εαρινό",
      "Εξάμηνο": "2ο",
      "Επιλογή": "Εξεταστική",
      "Ημερομηνίες": "2026-08-31",
      "Ώρα": "15:00",
      "Αίθουσα": "Γ2.1. Γ2.2. Α2",
      "Διάβασμα": "2026-08-17"
    },
    {
      "Μαθήματα": "CAM",
      "Περίοδος": "Εαρινό",
      "Εξάμηνο": "8ο",
      "Επιλογή": "Εξεταστική",
      "Ημερομηνίες": "2026-09-01",
      "Ώρα": "15:00",
      "Αίθουσα": "Γ2.2. Β1001. Β1008",
      "Διάβασμα": "2026-07-21"
    },
    {
      "Μαθήματα": "Στοχαστικές Διαδικασίες",
      "Περίοδος": "Χειμερινό",
      "Εξάμηνο": "5ο",
      "Επιλογή": "Εξεταστική",
      "Ημερομηνίες": "2026-09-04",
      "Ώρα": "18:00",
      "Αίθουσα": "Α2. Β1001",
      "Διάβασμα": "2026-07-27"
    },
    {
      "Μαθήματα": "Συνήθεις Διαφορικές",
      "Περίοδος": "Χειμερινό",
      "Εξάμηνο": "3ο",
      "Επιλογή": "Εξεταστική",
      "Ημερομηνίες": "2026-09-09",
      "Ώρα": "15:00",
      "Αίθουσα": "Α2. Β1001. Β1008",
      "Διάβασμα": "2026-08-03"
    },
    {
      "Μαθήματα": "Διαφορικός Ι",
      "Περίοδος": "Χειμερινό",
      "Εξάμηνο": "1ο",
      "Επιλογή": "Εξεταστική",
      "Ημερομηνίες": "2026-09-14",
      "Ώρα": "09:00",
      "Αίθουσα": "Γ2.1. Γ2.2",
      "Διάβασμα": "2026-08-03"
    }
  ],
  "electives": [
    {
      "#": 1,
      "Μάθημα": "Κοινωνιολογία",
      "Εξάμηνο": "3ο",
      "Ομάδα": "II",
      "Περασμένο": "Ναι",
      "Χρωστούμενο": false
    },
    {
      "#": 2,
      "Μάθημα": "Βιομηχανική Κοινωνιολογία",
      "Εξάμηνο": "4ο",
      "Ομάδα": "II",
      "Περασμένο": "Ναι",
      "Χρωστούμενο": false
    },
    {
      "#": 3,
      "Μάθημα": "Ηλεκτρονικό Επιχειρίν",
      "Εξάμηνο": "5ο",
      "Ομάδα": "ΙV",
      "Περασμένο": "Ναι",
      "Χρωστούμενο": false
    },
    {
      "#": 3,
      "Μάθημα": "Ηλεκτρονικό Επιχειρείν",
      "Εξάμηνο": "5ο",
      "Ομάδα": "IV",
      "Περασμένο": "Ναι",
      "Χρωστούμενο": false
    },
    {
      "#": 4,
      "Μάθημα": "Διοίκηση Ανθρώπινου Δυναμικού",
      "Εξάμηνο": "6ο",
      "Ομάδα": "VII",
      "Περασμένο": "Ναι",
      "Χρωστούμενο": false
    },
    {
      "#": 4,
      "Μάθημα": "Βιώσιμη Χρηματοοικονομική",
      "Εξάμηνο": "6ο",
      "Ομάδα": "VII",
      "Περασμένο": "Ναι",
      "Χρωστούμενο": false
    },
    {
      "#": 5,
      "Μάθημα": "Επιστήμη και Τεχνολογία Περιβάλλοντος",
      "Εξάμηνο": "7ο",
      "Ομάδα": "III",
      "Περασμένο": "Ναι",
      "Χρωστούμενο": false
    },
    {
      "#": 5,
      "Μάθημα": "Οικονομικά Ενέργειας & Περιβάλλοντος",
      "Εξάμηνο": "7ο",
      "Ομάδα": "III",
      "Περασμένο": "Ναι",
      "Χρωστούμενο": false
    },
    {
      "#": 6,
      "Μάθημα": "Μελέτες Περιβαλλοντικών Επιπτώσεων",
      "Εξάμηνο": "8ο",
      "Ομάδα": "V",
      "Περασμένο": "Ναι",
      "Χρωστούμενο": false
    },
    {
      "#": 7,
      "Μάθημα": "Διοίκηση Ολικής Ποιότητας",
      "Εξάμηνο": "8ο",
      "Ομάδα": "VII",
      "Περασμένο": "Ναι",
      "Χρωστούμενο": false
    },
    {
      "#": 8,
      "Μάθημα": "Προσθετική Κατασκευή",
      "Εξάμηνο": "9ο",
      "Ομάδα": "III",
      "Περασμένο": "Ναι",
      "Χρωστούμενο": false
    },
    {
      "#": 9,
      "Μάθημα": "Μηχατρονική",
      "Εξάμηνο": "9ο",
      "Ομάδα": "VI",
      "Περασμένο": "Ναι",
      "Χρωστούμενο": false
    },
    {
      "#": 10,
      "Μάθημα": "Χρηματοοικονομική Μηχανικη",
      "Εξάμηνο": "9ο",
      "Ομάδα": "VII",
      "Περασμένο": "Ναι",
      "Χρωστούμενο": false
    },
    {
      "#": 11,
      "Μάθημα": "Τεχνολογική Πρόβλεψη",
      "Εξάμηνο": "9ο",
      "Ομάδα": "VII",
      "Περασμένο": "Ναι",
      "Χρωστούμενο": false
    }
  ],
  "progress": [
    {
      "Μάθημα": "ΔΙΑΦΟΡΙΚΟΣ ΚΑΙ ΟΛΟΚΛΗΡΩΤΙΚΟΣ ΛΟΓΙΣΜΟΣ Ι",
      "Έτος": "1ο",
      "Εξάμηνο": "1ο",
      "Ημερομηνία Επιτυχίας": null,
      "Βαθμός": null,
      "Περασμένο": false,
      "Χρωστούμενο": true
    },
    {
      "Μάθημα": "ΓΡΑΜΜΙΚΗ ΑΛΓΕΒΡΑ",
      "Έτος": "1ο",
      "Εξάμηνο": "1ο",
      "Ημερομηνία Επιτυχίας": "2025-01-01",
      "Βαθμός": 6,
      "Περασμένο": true,
      "Χρωστούμενο": false
    },
    {
      "Μάθημα": "ΜΗΧΑΝΟΛΟΓΙΚΟ ΣΧΕΔΙΟ",
      "Έτος": "1ο",
      "Εξάμηνο": "1ο",
      "Ημερομηνία Επιτυχίας": "2021-01-01",
      "Βαθμός": 8,
      "Περασμένο": true,
      "Χρωστούμενο": false
    },
    {
      "Μάθημα": "ΜΕΘΟΔΟΛΟΓΙΑ ΠΡΟΓ/ΣΜΟΥ Η/Υ",
      "Έτος": "1ο",
      "Εξάμηνο": "1ο",
      "Ημερομηνία Επιτυχίας": "2023-09-01",
      "Βαθμός": 6,
      "Περασμένο": true,
      "Χρωστούμενο": false
    },
    {
      "Μάθημα": "ΜΕΘΟΔΟΛΟΓΙΑ ΤΗΣ ΕΠΙΧΕΙΡΗΣΙΑΚΗΣ ΕΡΕΥΝΑΣ",
      "Έτος": "1ο",
      "Εξάμηνο": "1ο",
      "Ημερομηνία Επιτυχίας": "2021-01-01",
      "Βαθμός": 6,
      "Περασμένο": true,
      "Χρωστούμενο": false
    },
    {
      "Μάθημα": "ΦΥΣΙΚΗ Ι",
      "Έτος": "1ο",
      "Εξάμηνο": "1ο",
      "Ημερομηνία Επιτυχίας": "2022-01-01",
      "Βαθμός": 6.5,
      "Περασμένο": true,
      "Χρωστούμενο": false
    },
    {
      "Μάθημα": "ΔΙΑΦΟΡΙΚΟΣ ΚΑΙ ΟΛΟΚΛΗΡΩΤΙΚΟΣ ΛΟΓΙΣΜΟΣ ΙΙ",
      "Έτος": "1ο",
      "Εξάμηνο": "2ο",
      "Ημερομηνία Επιτυχίας": null,
      "Βαθμός": null,
      "Περασμένο": false,
      "Χρωστούμενο": true
    },
    {
      "Μάθημα": "ΤΕΧΝΙΚΗ ΜΗΧΑΝΙΚΗ - ΣΤΑΤΙΚΗ",
      "Έτος": "1ο",
      "Εξάμηνο": "2ο",
      "Ημερομηνία Επιτυχίας": "2021-06-01",
      "Βαθμός": 5.5,
      "Περασμένο": true,
      "Χρωστούμενο": false
    },
    {
      "Μάθημα": "ΗΛΕΚΤΡΙΚΑ ΚΥΚΛΩΜΑΤΑ",
      "Έτος": "1ο",
      "Εξάμηνο": "2ο",
      "Ημερομηνία Επιτυχίας": "2022-06-01",
      "Βαθμός": 6,
      "Περασμένο": true,
      "Χρωστούμενο": false
    },
    {
      "Μάθημα": "ΑΛΓΟΡΙΘΜΟΙ ΚΑΙ ΔΟΜΕΣ ΔΕΔΟΜΕΝΩΝ",
      "Έτος": "1ο",
      "Εξάμηνο": "2ο",
      "Ημερομηνία Επιτυχίας": "2021-09-01",
      "Βαθμός": 5,
      "Περασμένο": true,
      "Χρωστούμενο": false
    },
    {
      "Μάθημα": "ΦΥΣΙΚΗ ΙΙ",
      "Έτος": "1ο",
      "Εξάμηνο": "2ο",
      "Ημερομηνία Επιτυχίας": "2026-01-01",
      "Βαθμός": 5,
      "Περασμένο": true,
      "Χρωστούμενο": false
    },
    {
      "Μάθημα": "ΓΕΝΙΚΗ ΧΗΜΕΙΑ",
      "Έτος": "1ο",
      "Εξάμηνο": "2ο",
      "Ημερομηνία Επιτυχίας": "2021-09-01",
      "Βαθμός": 8,
      "Περασμένο": true,
      "Χρωστούμενο": false
    },
    {
      "Μάθημα": "ΑΓΓΛΙΚΑ ΙΙΙ",
      "Έτος": "2ο",
      "Εξάμηνο": "3ο",
      "Ημερομηνία Επιτυχίας": "2022-01-01",
      "Βαθμός": 6.5,
      "Περασμένο": true,
      "Χρωστούμενο": false
    },
    {
      "Μάθημα": "ΚΟΙΝΩΝΙΟΛΟΓΙΑ",
      "Έτος": "2ο",
      "Εξάμηνο": "3ο",
      "Ημερομηνία Επιτυχίας": "2022-01-01",
      "Βαθμός": 5.5,
      "Περασμένο": true,
      "Χρωστούμενο": false
    },
    {
      "Μάθημα": "ΣΥΝΗΘΕΙΣ ΔΙΑΦΟΡΙΚΕΣ ΕΞΙΣΩΣΕΙΣ",
      "Έτος": "2ο",
      "Εξάμηνο": "3ο",
      "Ημερομηνία Επιτυχίας": null,
      "Βαθμός": null,
      "Περασμένο": false,
      "Χρωστούμενο": true
    },
    {
      "Μάθημα": "ΤΕΧΝΙΚΗ ΜΗΧΑΝΙΚΗ - ΑΝΤΟΧΗ ΥΛΙΚΩΝ",
      "Έτος": "2ο",
      "Εξάμηνο": "3ο",
      "Ημερομηνία Επιτυχίας": "2022-01-01",
      "Βαθμός": 10,
      "Περασμένο": true,
      "Χρωστούμενο": false
    },
    {
      "Μάθημα": "ΕΠΙΣΤΗΜΗ ΚΑΙ ΤΕΧΝΟΛΟΓΙΑ ΥΛΙΚΩΝ",
      "Έτος": "2ο",
      "Εξάμηνο": "3ο",
      "Ημερομηνία Επιτυχίας": "2026-06-01",
      "Βαθμός": 5,
      "Περασμένο": true,
      "Χρωστούμενο": false
    },
    {
      "Μάθημα": "ΠΙΘΑΝΟΤΗΤΕΣ ΓΙΑ ΜΗΧΑΝΙΚΟΥΣ",
      "Έτος": "2ο",
      "Εξάμηνο": "3ο",
      "Ημερομηνία Επιτυχίας": "2025-01-01",
      "Βαθμός": 8.5,
      "Περασμένο": true,
      "Χρωστούμενο": false
    },
    {
      "Μάθημα": "ΠΕΡΙΒΑΛΛΟΝΤΙΚΗ ΑΝΑΛΥΣΗ ΚΑΙ ΣΧΕΔΙΑΣΜΟΣ",
      "Έτος": "2ο",
      "Εξάμηνο": "3ο",
      "Ημερομηνία Επιτυχίας": "2022-01-01",
      "Βαθμός": 8,
      "Περασμένο": true,
      "Χρωστούμενο": false
    },
    {
      "Μάθημα": "ΑΓΓΛΙΚΑ IV",
      "Έτος": "2ο",
      "Εξάμηνο": "4ο",
      "Ημερομηνία Επιτυχίας": "2022-06-01",
      "Βαθμός": 6.5,
      "Περασμένο": true,
      "Χρωστούμενο": false
    },
    {
      "Μάθημα": "ΒΙΟΜΗΧΑΝΙΚΗ ΚΟΙΝΩΝΙΟΛΟΓΙΑ",
      "Έτος": "2ο",
      "Εξάμηνο": "4ο",
      "Ημερομηνία Επιτυχίας": "2022-06-01",
      "Βαθμός": 5,
      "Περασμένο": true,
      "Χρωστούμενο": false
    },
    {
      "Μάθημα": "ΑΡΙΘΜΗΤΙΚΗ ΑΝΑΛΥΣΗ",
      "Έτος": "2ο",
      "Εξάμηνο": "4ο",
      "Ημερομηνία Επιτυχίας": "2026-06-01",
      "Βαθμός": 6.5,
      "Περασμένο": true,
      "Χρωστούμενο": false
    },
    {
      "Μάθημα": "ΓΡΑΜΜΙΚΟΣ ΠΡΟΓΡΑΜΜΑΤΙΣΜΟΣ",
      "Έτος": "2ο",
      "Εξάμηνο": "4ο",
      "Ημερομηνία Επιτυχίας": "2026-01-01",
      "Βαθμός": 7,
      "Περασμένο": true,
      "Χρωστούμενο": false
    },
    {
      "Μάθημα": "ΣΤΑΤΙΣΤΙΚΗ ΓΙΑ ΜΗΧΑΝΙΚΟΥΣ",
      "Έτος": "2ο",
      "Εξάμηνο": "4ο",
      "Ημερομηνία Επιτυχίας": "2026-01-01",
      "Βαθμός": 10,
      "Περασμένο": true,
      "Χρωστούμενο": false
    },
    {
      "Μάθημα": "ΣΤΟΙΧΕΙΑ ΜΗΧΑΝΩΝ",
      "Έτος": "2ο",
      "Εξάμηνο": "4ο",
      "Ημερομηνία Επιτυχίας": "2022-06-01",
      "Βαθμός": 8,
      "Περασμένο": true,
      "Χρωστούμενο": false
    },
    {
      "Μάθημα": "ΣΥΣΤΗΜΑΤΑ ΚΑΙ ΔΙΕΡΓΑΣΙΕΣ ΔΙΟΙΚΗΣΗΣ",
      "Έτος": "3ο",
      "Εξάμηνο": "5ο",
      "Ημερομηνία Επιτυχίας": "2023-01-01",
      "Βαθμός": 8,
      "Περασμένο": true,
      "Χρωστούμενο": false
    },
    {
      "Μάθημα": "ΘΕΡΜΟΔΥΝΑΜΙΚΗ",
      "Έτος": "3ο",
      "Εξάμηνο": "5ο",
      "Ημερομηνία Επιτυχίας": "2024-09-01",
      "Βαθμός": 9.5,
      "Περασμένο": true,
      "Χρωστούμενο": false
    },
    {
      "Μάθημα": "ΗΛΕΚΤΡΟΝΙΚΟ ΕΠΙΧΕΙΡΕΙΝ",
      "Έτος": "3ο",
      "Εξάμηνο": "5ο",
      "Ημερομηνία Επιτυχίας": "2023-01-01",
      "Βαθμός": 6,
      "Περασμένο": true,
      "Χρωστούμενο": false
    },
    {
      "Μάθημα": "ΤΕΧΝΟΛΟΓΙΑ ΠΑΡΑΓΩΓΗΣ Ι",
      "Έτος": "3ο",
      "Εξάμηνο": "5ο",
      "Ημερομηνία Επιτυχίας": "2023-09-01",
      "Βαθμός": 5.5,
      "Περασμένο": true,
      "Χρωστούμενο": false
    },
    {
      "Μάθημα": "ΣΤΟΧΑΣΤΙΚΕΣ ΔΙΑΔΙΚΑΣΙΕΣ",
      "Έτος": "3ο",
      "Εξάμηνο": "5ο",
      "Ημερομηνία Επιτυχίας": null,
      "Βαθμός": null,
      "Περασμένο": false,
      "Χρωστούμενο": true
    },
    {
      "Μάθημα": "ΣΥΝΔΥΑΣΤΙΚΗ ΒΕΛΤΙΣΤΟΠΟΙΗΣΗ",
      "Έτος": "3ο",
      "Εξάμηνο": "5ο",
      "Ημερομηνία Επιτυχίας": "2023-01-01",
      "Βαθμός": 6,
      "Περασμένο": true,
      "Χρωστούμενο": false
    },
    {
      "Μάθημα": "ΡΕΥΣΤΟΜΗΧΑΝΙΚΗ",
      "Έτος": "3ο",
      "Εξάμηνο": "6ο",
      "Ημερομηνία Επιτυχίας": "2023-06-01",
      "Βαθμός": 7,
      "Περασμένο": true,
      "Χρωστούμενο": false
    },
    {
      "Μάθημα": "ΔΙΟΙΚΗΣΗ ΑΝΘΡΩΠΙΝΟΥ ΔΥΝΑΜΙΚΟΥ",
      "Έτος": "3ο",
      "Εξάμηνο": "6ο",
      "Ημερομηνία Επιτυχίας": "2023-06-01",
      "Βαθμός": 8,
      "Περασμένο": true,
      "Χρωστούμενο": false
    },
    {
      "Μάθημα": "ΤΕΧΝΟΛΟΓΙΑ ΠΑΡΑΓΩΓΗΣ ΙΙ",
      "Έτος": "3ο",
      "Εξάμηνο": "6ο",
      "Ημερομηνία Επιτυχίας": "2024-09-01",
      "Βαθμός": 7,
      "Περασμένο": true,
      "Χρωστούμενο": false
    },
    {
      "Μάθημα": "ΣΥΣΤΗΜΑΤΑ ΠΑΡΑΓΩΓΗΣ",
      "Έτος": "3ο",
      "Εξάμηνο": "6ο",
      "Ημερομηνία Επιτυχίας": "2026-06-01",
      "Βαθμός": 6.5,
      "Περασμένο": true,
      "Χρωστούμενο": false
    },
    {
      "Μάθημα": "ΣΥΣΤΗΜΑΤΑ ΥΠΟΣΤΗΡΙΞΗΣ ΑΠΟΦΑΣΕΩΝ",
      "Έτος": "3ο",
      "Εξάμηνο": "6ο",
      "Ημερομηνία Επιτυχίας": "2026-06-01",
      "Βαθμός": 7,
      "Περασμένο": true,
      "Χρωστούμενο": false
    },
    {
      "Μάθημα": "ΜΗ ΓΡΑΜΜΙΚΟΣ ΠΡΟΓΡΑΜΜΑΤΙΣΜΟΣ",
      "Έτος": "3ο",
      "Εξάμηνο": "6ο",
      "Ημερομηνία Επιτυχίας": "2023-09-01",
      "Βαθμός": 5,
      "Περασμένο": true,
      "Χρωστούμενο": false
    },
    {
      "Μάθημα": "ΜΕΤΑΔΟΣΗ ΘΕΡΜΟΤΗΤΑΣ",
      "Έτος": "4ο",
      "Εξάμηνο": "7ο",
      "Ημερομηνία Επιτυχίας": "2026-01-01",
      "Βαθμός": 8,
      "Περασμένο": true,
      "Χρωστούμενο": false
    },
    {
      "Μάθημα": "ΣΥΣΤΗΜΑΤΑ ΕΛΕΓΧΟΥ Ι",
      "Έτος": "4ο",
      "Εξάμηνο": "7ο",
      "Ημερομηνία Επιτυχίας": "2026-06-01",
      "Βαθμός": 9.5,
      "Περασμένο": true,
      "Χρωστούμενο": false
    },
    {
      "Μάθημα": "ΧΡΗΜΑΤΟΟΙΚΟΝΟΜΙΚΗ ΔΙΟΙΚΗΣΗ",
      "Έτος": "4ο",
      "Εξάμηνο": "7ο",
      "Ημερομηνία Επιτυχίας": "2024-06-01",
      "Βαθμός": 5.5,
      "Περασμένο": true,
      "Χρωστούμενο": false
    },
    {
      "Μάθημα": "ΕΛΕΓΧΟΣ ΠΟΙΟΤΗΤΑΣ",
      "Έτος": "4ο",
      "Εξάμηνο": "7ο",
      "Ημερομηνία Επιτυχίας": "2026-01-01",
      "Βαθμός": 5,
      "Περασμένο": true,
      "Χρωστούμενο": false
    },
    {
      "Μάθημα": "ΜΑΡΚΕΤΙΝΓΚ",
      "Έτος": "4ο",
      "Εξάμηνο": "7ο",
      "Ημερομηνία Επιτυχίας": "2024-01-01",
      "Βαθμός": 7.5,
      "Περασμένο": true,
      "Χρωστούμενο": false
    },
    {
      "Μάθημα": "ΕΠΙΣΤΗΜΗ ΚΑΙ ΤΕΧΝΟΛΟΓΙΑ ΠΕΡΙΒΑΛΛΟΝΤΟΣ",
      "Έτος": "4ο",
      "Εξάμηνο": "7ο",
      "Ημερομηνία Επιτυχίας": "2026-01-01",
      "Βαθμός": 6,
      "Περασμένο": true,
      "Χρωστούμενο": false
    },
    {
      "Μάθημα": "ΥΔΡΟΔΥΝΑΜΙΚΕΣ & ΘΕΡΜΙΚΕΣ ΜΗΧΑΝΕΣ",
      "Έτος": "4ο",
      "Εξάμηνο": "8ο",
      "Ημερομηνία Επιτυχίας": "2025-06-01",
      "Βαθμός": 5,
      "Περασμένο": true,
      "Χρωστούμενο": false
    },
    {
      "Μάθημα": "ΔΙΟΙΚΗΣΗ ΟΛΙΚΗΣ ΠΟΙΟΤΗΤΑΣ",
      "Έτος": "4ο",
      "Εξάμηνο": "8ο",
      "Ημερομηνία Επιτυχίας": "2025-06-01",
      "Βαθμός": 9,
      "Περασμένο": true,
      "Χρωστούμενο": false
    },
    {
      "Μάθημα": "ΔΙΚΤΥΑ ΠΑΡΑΓΩΓΗΣ (CAM)",
      "Έτος": "4ο",
      "Εξάμηνο": "8ο",
      "Ημερομηνία Επιτυχίας": null,
      "Βαθμός": null,
      "Περασμένο": false,
      "Χρωστούμενο": true
    },
    {
      "Μάθημα": "ΑΝΑΛΥΣΗ ΕΠΕΝΔΥΤΙΚΩΝ ΑΠΟΦΑΣΕΩΝ",
      "Έτος": "4ο",
      "Εξάμηνο": "8ο",
      "Ημερομηνία Επιτυχίας": "2025-06-01",
      "Βαθμός": 5.5,
      "Περασμένο": true,
      "Χρωστούμενο": false
    },
    {
      "Μάθημα": "ΜΕΛΕΤΗ-ΣΧΕΔΙΑΣΗ ΜΕ ΧΡΗΣΗ Η/Υ (CAD)",
      "Έτος": "4ο",
      "Εξάμηνο": "8ο",
      "Ημερομηνία Επιτυχίας": "2024-06-01",
      "Βαθμός": 9,
      "Περασμένο": true,
      "Χρωστούμενο": false
    },
    {
      "Μάθημα": "ΕΡΓΟΝΟΜΙΑ ΚΑΙ ΔΙΑΧΕΙΡΙΣΗ ΑΣΦΑΛΕΙΑΣ",
      "Έτος": "4ο",
      "Εξάμηνο": "8ο",
      "Ημερομηνία Επιτυχίας": "2025-09-01",
      "Βαθμός": 8.5,
      "Περασμένο": true,
      "Χρωστούμενο": false
    },
    {
      "Μάθημα": "ΜΕΛΕΤΕΣ ΠΕΡΙΒΑΛΛΟΝΤΙΚΩΝ ΕΠΙΠΤΩΣΕΩΝ",
      "Έτος": "4ο",
      "Εξάμηνο": "8ο",
      "Ημερομηνία Επιτυχίας": "2025-09-01",
      "Βαθμός": 6.5,
      "Περασμένο": true,
      "Χρωστούμενο": false
    },
    {
      "Μάθημα": "ΟΡΓΑΝΩΣΗ ΠΑΡΑΓΩΓΗΣ & ΠΡΟΓ/ΣΜΟΣ ΕΡΓΩΝ",
      "Έτος": "5ο",
      "Εξάμηνο": "9ο",
      "Ημερομηνία Επιτυχίας": "2026-06-01",
      "Βαθμός": 8,
      "Περασμένο": true,
      "Χρωστούμενο": false
    },
    {
      "Μάθημα": "ΧΡΗΜΑΤΟΟΙΚΟΝΟΜΙΚΗ ΜΗΧΑΝΙΚΗ",
      "Έτος": "5ο",
      "Εξάμηνο": "9ο",
      "Ημερομηνία Επιτυχίας": "2025-01-01",
      "Βαθμός": 6.5,
      "Περασμένο": true,
      "Χρωστούμενο": false
    },
    {
      "Μάθημα": "ΜΗΧΑΤΡΟΝΙΚΗ",
      "Έτος": "5ο",
      "Εξάμηνο": "9ο",
      "Ημερομηνία Επιτυχίας": "2025-09-01",
      "Βαθμός": 8.5,
      "Περασμένο": true,
      "Χρωστούμενο": false
    },
    {
      "Μάθημα": "ΡΟΜΠΟΤΙΚΗ",
      "Έτος": "5ο",
      "Εξάμηνο": "9ο",
      "Ημερομηνία Επιτυχίας": "2025-09-01",
      "Βαθμός": 6,
      "Περασμένο": true,
      "Χρωστούμενο": false
    },
    {
      "Μάθημα": "ΤΕΧΝΟΛΟΓΙΚΗ ΠΡΟΒΛΕΨΗ",
      "Έτος": "5ο",
      "Εξάμηνο": "9ο",
      "Ημερομηνία Επιτυχίας": "2025-01-01",
      "Βαθμός": 9,
      "Περασμένο": true,
      "Χρωστούμενο": false
    },
    {
      "Μάθημα": "ΠΡΟΣΘΕΤΙΚΗ ΚΑΤΑΣΚΕΥΗ",
      "Έτος": "5ο",
      "Εξάμηνο": "9ο",
      "Ημερομηνία Επιτυχίας": "2025-01-01",
      "Βαθμός": 5,
      "Περασμένο": true,
      "Χρωστούμενο": false
    }
  ],
  "progressSeries": [
    {
      "Εξεταστική": "2021-01-01",
      "Περασμένα": 2,
      "Χρωστούμενα": 54,
      "Μέσος όρος": 7
    },
    {
      "Εξεταστική": "2021-06-01",
      "Περασμένα": 1,
      "Χρωστούμενα": 53,
      "Μέσος όρος": 5.5
    },
    {
      "Εξεταστική": "2021-09-01",
      "Περασμένα": 2,
      "Χρωστούμενα": 51,
      "Μέσος όρος": 6.5
    },
    {
      "Εξεταστική": "2022-01-01",
      "Περασμένα": 5,
      "Χρωστούμενα": 46,
      "Μέσος όρος": 7.3
    },
    {
      "Εξεταστική": "2022-06-01",
      "Περασμένα": 4,
      "Χρωστούμενα": 42,
      "Μέσος όρος": 6.375
    },
    {
      "Εξεταστική": "2022-09-01",
      "Περασμένα": 0,
      "Χρωστούμενα": 42,
      "Μέσος όρος": null
    },
    {
      "Εξεταστική": "2023-01-01",
      "Περασμένα": 3,
      "Χρωστούμενα": 39,
      "Μέσος όρος": 6.666666667
    },
    {
      "Εξεταστική": "2023-06-01",
      "Περασμένα": 2,
      "Χρωστούμενα": 37,
      "Μέσος όρος": 7.5
    },
    {
      "Εξεταστική": "2023-09-01",
      "Περασμένα": 3,
      "Χρωστούμενα": 34,
      "Μέσος όρος": 5.5
    },
    {
      "Εξεταστική": "2024-01-01",
      "Περασμένα": 1,
      "Χρωστούμενα": 33,
      "Μέσος όρος": 7.5
    },
    {
      "Εξεταστική": "2024-06-01",
      "Περασμένα": 2,
      "Χρωστούμενα": 31,
      "Μέσος όρος": 7.25
    },
    {
      "Εξεταστική": "2024-09-01",
      "Περασμένα": 2,
      "Χρωστούμενα": 29,
      "Μέσος όρος": 8.25
    },
    {
      "Εξεταστική": "2025-01-01",
      "Περασμένα": 5,
      "Χρωστούμενα": 24,
      "Μέσος όρος": 7
    },
    {
      "Εξεταστική": "2025-06-01",
      "Περασμένα": 3,
      "Χρωστούμενα": 21,
      "Μέσος όρος": 6.5
    },
    {
      "Εξεταστική": "2025-09-01",
      "Περασμένα": 4,
      "Χρωστούμενα": 17,
      "Μέσος όρος": 7.375
    },
    {
      "Εξεταστική": "2026-01-01",
      "Περασμένα": 6,
      "Χρωστούμενα": 11,
      "Μέσος όρος": 6.833333333
    },
    {
      "Εξεταστική": "2026-06-01",
      "Περασμένα": 6,
      "Χρωστούμενα": 5,
      "Μέσος όρος": 7.083333333
    }
  ],
  "stats": {
    "examCourseCount": 5,
    "passedCount": 51,
    "owedCount": 5,
    "averageGrade": 6.9
  }
};
